<script>
  import ModalWindow from './ModalWindow.svelte'

  let heroes_list = [
    {
      id: 1,
      name: "Арина Петровна",
      body: "Арина Петровна Головлева является дворянкой, богатой помещицей. Она живет в своем имении Головлево где-то в глубинке России",
      src: "https://www.kino-teatr.ru/acter/album/1010/547114.jpg",
      more: " «Арина Петровна — женщина лет шестидесяти, но еще бодрая и привыкшая жить на всей своей воле. Держит она себя грозно; единолично и бесконтрольно управляет обширным головлёвским имением, живет уединенно, расчетливо, почти скупо, с соседями дружбы не водит, местным властям доброходствует, а от детей требует, чтоб они были в таком у нее послушании, чтобы при каждом поступке спрашивали себя: что-то об этом маменька скажет? Вообще имеет характер самостоятельный, непреклонный и отчасти строптивый, чему, впрочем, немало способствует и то, что во всем головлёвском семействе нет ни одного человека, со стороны которого она могла бы встретить противодействие.» — М. Е. Салтыков-Щедрин «Господа Головлёвы».",

    },
    {
      id: 6,
      name: "Владимир Михайлович",
      body: "Владимир Михайлович Головлев является мужем властной помещицы Арины Петровны Головлевой",
      src: "http://telespektakli.ru/published/publicdata/SMAN13NEW/attachments/SC/products_pictures/00-53-466u_enl.jpg",
      more: "«Глава семейства, Владимир Михайлович Головлёв, еще смолоду был известен своим безалаберным и озорным характером, и для Арины Петровны, всегда отличавшейся серьёзностью и деловитостью, никогда ничего симпатичного не представлял. Он вел жизнь праздную и бездельную, чаще всего запирался у себя в кабинете, подражал пению скворцов, петухов и т. д. и занимался сочинением так называемых „вольных стихов“ <…> Арина Петровна сразу не залюбила этих стихов своего мужа, называла их паскудством и паясничаньем, а так как Владимир Михайлович собственно для того и женился, чтобы всегда иметь под рукой слушателя для своих стихов, то понятно, что размолвки не заставили долго ждать себя. Постепенно разрастаясь и ожесточаясь, размолвки эти кончились, со стороны жены, полным и презрительным равнодушием к мужу-шуту, со стороны мужа — искреннею ненавистью к жене, ненавистью, в которую, однако ж, входила значительная доля трусости» — М. Е. Салтыков-Щедрин «Господа Головлёвы».",

    },
    {
      id: 3,
      name: "Степан",
      body: "Степан Владимирович Головлев - помещик, дворянин. Он является старшим сыном помещицы Арины Петровны Головлевой",
      src: "https://www.kino-teatr.ru/acter/album/1928/107016.jpg",
      more: "«Степан Владимирович, старший сын, <…>, слыл в семействе под именем Степки-балбеса и Степки-озорника. Он очень рано попал в число „постылых“ и с детских лет играл в доме роль не то парии, не то шута. К несчастию, это был даровитый малый, слишком охотно и быстро воспринимавший впечатления, которые вырабатывала окружающая среда. От отца он перенял неистощимую проказливость, от матери — способность быстро угадывать слабые стороны людей. Благодаря первому качеству, он скоро сделался любимцем отца, что еще больше усилило нелюбовь к нему матери. Часто, во время отлучек Арины Петровны по хозяйству, отец и подросток-сын удалялись в кабинет, украшенный портретом Баркова, читали стихи вольного содержания и судачили, причем в особенности доставалось „ведьме“, то есть Арине Петровне. Но „ведьма“ словно чутьем угадывала их занятия; неслышно подъезжала она к крыльцу, подходила на цыпочках к кабинетной двери и подслушивала веселые речи. Затем следовало немедленное и жестокое избиение Степки-балбеса. Но Степка не унимался; он был нечувствителен ни к побоям, ни к увещаниям и через полчаса опять принимался куролесить. То косынку у девки Анютки изрежет в куски, то сонной Васютке мух в рот напустит, то заберется на кухню и стянет там пирог (Арина Петровна, из экономии, держала детей впроголодь), который, впрочем, тут же разделит с братьями». — М. Е. Салтыков-Щедрин «Господа Головлёвы».",


    },
    {
      id: 5,
      name: "Анна Владимировна",
      body: "Анна Владимировна Головлева (в замужестве Уланова) является  дочерью помещицы Арины Петровны Головлевой",
      src: "http://m.kino-teatr.ru/movie/kadr/79996/541703.jpg",
      more: " «После Степана Владимировича, старшим членом головлёвского семейства была дочь, Анна Владимировна, о которой Арина Петровна тоже не любила говорить. Дело в том, что на Аннушку Арина Петровна имела виды, а Аннушка не только не оправдала ее надежд, но вместо того на весь уезд учинила скандал. Когда дочь вышла из института, Арина Петровна поселила ее в деревне, в чаянье сделать из нее дарового домашнего секретаря и бухгалтера, а вместо того Аннушка, в одну прекрасную ночь, бежала из Головлёва с корнетом Улановым и повенчалась с ним. Года через два молодые капитал прожили, и корнет неизвестно куда бежал, оставив Анну Владимировну с двумя дочерьми-близнецами: Аннинькой и Любонькой. Затем и сама Анна Владимировна через три месяца скончалась, и Арина Петровна волей-неволей должна была приютить круглых сирот у себя. Что она и исполнила, поместив малюток во флигеле и приставив к ним кривую старуху Палашку». — М. Е. Салтыков-Щедрин «Господа Головлёвы».",

    },
    {
      id: 2,
      name: "Порфирий",
      body: "Порфирий Владимирович Головлев, он же \"Иудушка\", является сыном помещицы Арины Петровны Головлевой. Он является средним из трех сыновей помещицы. Возраст Порфирия Головлева - около 40 лет",
      src: "http://m.kino-teatr.ru/acter/album/22458/167402.jpg",
      more: " «Порфирий Владимирович известен был в семействе под тремя именами: Иудушки, кровопивушки и откровенного мальчика, каковые прозвища еще в детстве были ему даны Степкой-балбесом. С младенческих лет любил он приласкаться к милому другу маменьке, украдкой поцеловать ее в плечико, а иногда и слегка понаушничать. Неслышно отворит, бывало, дверь маменькиной комнаты, неслышно прокрадется в уголок, сядет и, словно очарованный, не сводит глаз с маменьки, покуда она пишет или возится со счетами. Но Арина Петровна уже и тогда с какою-то подозрительностью относилась к этим сыновним заискиваньям. И тогда этот пристально устремленный на нее взгляд казался ей загадочным, и тогда она не могла определить себе, что именно он источает из себя: яд или сыновнюю почтительность» — М. Е. Салтыков-Щедрин «Господа Головлёвы».",

    },
    {
      id: 4,
      name: "Павел",
      body: "Павел Владимирович Головлев является младшим сыном помещицы Арины Петровны Головлевой",
      src: "https://www.kino-teatr.ru/acter/album/256124/145882.jpg",
      more: "«Совершенную противоположность с Порфирием Владимировичем представлял брат его, Павел Владимирович. Это было полнейшее олицетворение человека, лишенного каких бы то ни было поступков. Еще мальчиком, он не выказывал ни малейшей склонности ни к ученью, ни к играм, ни к общительности, но любил жить особняком, в отчуждении от людей. Забьется, бывало, в угол, надуется и начнет фантазировать. Представляется ему, что он толокна наелся, что от этого ноги сделались у него тоненькие, и он не учится. Или — что он не Павел-дворянский сын, а Давыдка-пастух, что на лбу у него выросла болона, как и у Давыдки, что он арапником щелкает и не учится. Поглядит-поглядит, бывало, на него Арина Петровна, и так и раскипятится ее материнское сердце» — М. Е. Салтыков-Щедрин«Господа Головлёвы».",

    },
    // {
    //   id: 7,
    //   name: "Петенька и Володенька",
    //   body: "Петенька и Володенька Головлевы являются сыновьями Порфирия (\"Иудушки\") Головлева и внуками богатой властной помещицы Арины Петровны Головлевой",
    //   src: "https://kudago.com/media/images/event/ba/ce/bace2f2eac7f514a7112e98f4498cd61_3.jpg",
    //
    // },
  ];

  let about = {};

  function showDetail(event) {
    // Get data of hero and show modal window
    let searched_id = Number(event.target.getAttribute('id'));
    about = heroes_list.find(t => t.id === searched_id)
  }

</script>

<div class="container-fluid">
  <div class="row">
    {#each heroes_list as {id, name, body, src} (id)}
      <div class="card col-lg-3">
        <img class="card-img-top" {src} alt={name}>
        <div class="card-body d-flex flex-column">
          <h5 class="card-title">{name}</h5>
          <p class="card-text">{body}</p>
          <a href="#exampleModalLong" class="btn btn-primary mt-auto" on:click={showDetail} {id} data-toggle="modal">Узнать подробнее</a>
        </div>
      </div>
    {:else}
      <p>Героев не найдено!</p>
    {/each}
  </div>
</div>

<div class="modal fade" id="exampleModalLong" tabindex="-1" role="dialog" aria-labelledby="exampleModalLongTitle" aria-hidden="true">
  <div class="modal-dialog" role="document">
    <div class="modal-content">
      <div class="modal-header">
        <h5 class="modal-title" id="exampleModalLongTitle">{about.name}</h5>
        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body">
        {about.more}
      </div>
      <div class="modal-footer">
        <button type="button" class="btn btn-secondary" data-dismiss="modal">Закрыть</button>
      </div>
    </div>
  </div>
</div>

<style>
  .card {
    margin: 30px;
  }
</style>
